/*******************************************************
**programmer:hzw.
**
**time:2017/03/07
**
**summary:确保页面内容与腹肌页面内容相互关联。可使用父页面内容函数。操作子页面之间的内容跳转。
********************************************************/

var doc = window.parent;

//预设定的相关事件内容。
var concat = (function(c){
    
    c.pageCount = 2;//页面内容总数。
    
    var slipping = false; //设置是否支持滑屏翻页内容。
    
    var pageURL = './public';

    c.slipping = {}//编写相关的划屏点击事件内容进行设置。
    
    c.click = {}//编写点击跳转事件。
    
/*******************************************************
**事件注入。
**推荐使用依赖性质的事件绑定。编写denpendencyEvent对象数组后直接调用injection函数。
********************************************************/
    c.dependencyEvent = [];
    c.injection = function(){
           
    }
    
/*******************************************************
**预加载。
**推荐使用依赖性质的预加载。编写denpendencyPreload对象数组后直接调用loading函数。
********************************************************/
    c.dependencyPreload = [];
    c.loading = function(){
        
    }
    
/*******************************************************
**点击跳页设置。
********************************************************/
    c.exchangePage = function(ele){
        
    }
    
/*******************************************************
**初始化页面内容与事件。
********************************************************/
    c.init = function(){
           
    }
    
    return c;
}

})(concat || window.concat || {});

//页面初始化内容函数
doc.exp.event.addEvents(window, 'load', function(){
    
    concat.init();

},false);